package com.javarush.test.level09.lesson11.home05;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.ArrayList;
import java.util.Arrays;

/* Гласные и согласные буквы
Написать программу, которая вводит с клавиатуры строку текста.
Программа должна вывести на экран две строки:
1. первая строка содержит только гласные буквы
2. вторая - только согласные буквы и знаки препинания из введённой строки.
Буквы соединять пробелом, каждая строка должна заканчиваться пробелом.

Пример ввода:
Мама мыла раму.
Пример вывода:
а а ы а а у
М м м л р м .
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        String s = reader.readLine();
        ArrayList<Character> list = new ArrayList<>();
        ArrayList<Character> list_gl = new ArrayList<>();
        ArrayList<Character> list_sogl = new ArrayList<>();
        char[] chArray = s.toCharArray();
        for (char ch: chArray)
            list.add(ch);
        for (char ch: list)
            if (isVowel(ch))
                list_gl.add(ch);
            else
            if (!isVowel(ch) & ch != ' ')
                list_sogl.add(ch);
        for (char ch: list_gl)
            System.out.print(ch + " ");
        System.out.println();
        for (char ch: list_sogl)
            System.out.print(ch + " ");
    }


    public static char[] vowels = new char[]{'а', 'я', 'у', 'ю', 'и', 'ы', 'э', 'е', 'о', 'ё'};

    //метод проверяет, гласная ли буква
    public static boolean isVowel(char c)
    {
        c = Character.toLowerCase(c);  //приводим символ в нижний регистр - от заглавных к строчным буквам

        for (char d : vowels)   //ищем среди массива гласных
        {
            if (c == d)
                return true;
        }
        return false;
    }
}
